{"format": "layers-model", "generatedBy": "keras v3.11.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.11.1", "backend": "tensorflow", "model_config": {"class_name": "SimpleNNModel", "config": {"trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "simple_nn_model_1/dense_3/kernel", "shape": [16384, 128], "dtype": "float32"}, {"name": "simple_nn_model_1/dense_3/bias", "shape": [128], "dtype": "float32"}, {"name": "simple_nn_model_1/dense_4/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "simple_nn_model_1/dense_4/bias", "shape": [64], "dtype": "float32"}, {"name": "simple_nn_model_1/dense_5/kernel", "shape": [64, 2], "dtype": "float32"}, {"name": "simple_nn_model_1/dense_5/bias", "shape": [2], "dtype": "float32"}, {"name": "simple_nn_model_1/embedding_1/embeddings", "shape": [6400, 64], "dtype": "float32"}]}]}