{"format": "layers-model", "generatedBy": "keras v3.11.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.11.1", "backend": "tensorflow", "model_config": {"class_name": "LSTMModel", "config": {"trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}}}, "weightsManifest": [{"paths": [], "weights": []}]}